/*******************************************************************************
            > 文件: ROC_Tony
            > 作者: Tony Ben
            > 电子邮箱: tonyben1991@outlook.com
            > 创建时间: 2016-10-09-08.26

            > 策略原理:
               	1.
            > 测试品种:
                1.
            > 适用周期:
                1.
            > 参数列表:
                1.
*******************************************************************************/

Params
    Nomeric Length(12);

Vars
    Numeric ROC;

Begin
    ROC = 100 * (Close / Close[Length]);
    PlotNumeric("ROC", ROC);

End
